app/Controllers/EstadosController.php

SELECT *
FROM `estados`
---
    public function index(): string
    {
        $estado = new EstadosModel();
        $datos ['datos'] = $estado->findAll();

INSERT INTO `estados` (`id_estado`, `nombre`) VALUES ('3', 'Vencido')
---
    public function agregarEstado()
    {
        $estado = new EstadosModel();
        $datos=[
            'id_estado'=>$this->request->getpost('txt_codigo'),
            'nombre'=>$this->request->getpost('txt_nombre'),
        ];

        $estado->insert($datos);

SELECT *
FROM `estados`
WHERE `id_estado` = '2'
 LIMIT 1
---
    public function buscarEstado($codigo)
    {
        $estado = new EstadosModel();
        $datos['datos']=$estado->where('id_estado',$codigo)->first();