app/Controllers/MetodosPagosController.php

    public function index(): string
    {
        $metodos_pagos = new MetodosPagosModel();
        $datos ['datos'] = $metodos_pagos->findAll();
---
SELECT *
FROM `metodos_pagos`

    public function agregarMetodosPagos()
    {
        $metodos_pagos = new MetodosPagosModel();
        $datos=[
            'id_metodo_pago'=>$this->request->getpost('txt_codigo'),
            'tarjeta'=>$this->request->getpost('txt_tarjeta'),
            'transferencia'=>$this->request->getpost('txt_transferencia'),
        ];

        $metodos_pagos->insert($datos);
---
INSERT INTO `metodos_pagos` (`id_metodo_pago`, `tarjeta`, `transferencia`) VALUES ('102', '12345', '4321')