app/Controllers/PagosController.php

SELECT *
FROM `pagos`
---
    public function index(): string
    {

        $pago = new PagosModel();
        $datos ['datos'] = $pago->findAll();

SELECT *
FROM `pagos`
WHERE `id_pagos` = '1'
 LIMIT 1
---
    public function buscarPago($codigo)
    {
        $pago = new PagosModel();
        $datos['datos']=$pago->where('id_pagos',$codigo)->first();