app/Controllers/UsuariosController.php

    public function index()
    {
        $email = $this->request->getPost('txt_usuario');
        $contra = $this->request->getPost('txt_contra');
        $usuarios = new UsuariosModel();
        /*select * from usuarios where email= .. and password= ...*/
        $datos= $usuarios->select('nombre,tipo_usuario_id')
            ->where('email',$email)
            ->where('password',$contra)
            ->first();
---
SELECT `nombre`, `tipo_usuario_id`
FROM `usuarios`
WHERE `email` = 'roberto.gomez@gmail.com'
AND `password` = 'RGomez68!'
 LIMIT 1