app/Controllers/UsuarioController.php

    public function index(): string
    {

        $usuario = new UsuariosModel();
        $datos ['datos'] = $usuario->findAll();
---
SELECT *
FROM `usuarios`

         public function eliminarUsuario($id)
         {
        $usuario = new UsuariosModel();
        $usuario->delete($id);
---
DELETE FROM `usuarios`
WHERE `usuario_id` IN ('7')

    public function buscarUsuario($codigo)
    {
        $usuario = new UsuariosModel();
        $datos['datos']=$usuario->where('usuario_id',$codigo)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario_id` = '7'
 LIMIT 1